УНФ_ТЕСТ/src/Documents/ЗадачаСотрудника/ЗадачаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаСотрудника</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтроковаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.ТегиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Documents/ЗадачаСотрудника/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Дата = ТекущаяДатаСеанса();
		Автор = АвторизованныйПользователь;
		Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			АвторизованныйПользователь, "ОсновнойОтветственный");
		Календарь = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойКалендарь");
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ЗаполнитьНаименованиеОписание(ДанныеЗаполнения);
		ЗаполнитьПоДаннымКалендаря(ДанныеЗаполнения);
		ЗаполнитьОснование(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемоеНаименование = ПроверяемыеРеквизиты.Найти("Наименование");
	Если ПроверяемоеНаименование <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемоеНаименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаНачала");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменСGoogle.ПередЗаписьюИсточникаЗаписиКалендаря(ЭтотОбъект);
	Наименование = СтрПолучитьСтроку(Описание, 1);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменСGoogle.ПриЗаписиИсточникаЗаписиКалендаря(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаименованиеОписание(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("Наименование") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ДанныеЗаполнения.Наименование)
		И НЕ СтрНачинаетсяС(Описание, ДанныеЗаполнения.Наименование) Тогда
		Наименование = ДанныеЗаполнения.Наименование;
		Описание = ДанныеЗаполнения.Наименование + Символы.ПС + Описание;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымКалендаря(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("ДанныеЗаписиКалендаря") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения.ДанныеЗаписиКалендаря.Свойство("Начало",    ДатаНачала);
	ДанныеЗаполнения.ДанныеЗаписиКалендаря.Свойство("Окончание", ДатаОкончания);
	ДанныеЗаполнения.ДанныеЗаписиКалендаря.Свойство("Описание",  Описание);
	
КонецПроцедуры

Процедура ЗаполнитьОснование(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("Основание") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("Строка") Тогда
		Основание = Неопределено;
		ОснованиеСтроковаяСсылка = ДанныеЗаполнения.Основание;
		ДанныеЗаполнения.Свойство("ОснованиеПредставление", ОснованиеПредставление);
	Иначе
		Основание = ДанныеЗаполнения.Основание;
		ОснованиеСтроковаяСсылка = Неопределено;
		ОснованиеПредставление = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
